<?php

if (!defined('INC'))
	exit;

//error_reporting(E_ALL);

//Този файл ще съдържа всички настройки на сайта ни
session_start();

/*
 * Създаваме масив, който ще съдържа всички линкове от менюто на системата.
 * Правим го с цел всеки път когато добавим нов линк, той да се добавя
 * автоматично в менюто. Всеки нов линк в менюто представлява внедрен масив,
 * който има 3 ключа:
 * title - съдържа името на линка, което ще се показва на потребителя
 * page - съдържа страницата, към която ще пренасочва потребителя ($_GET['page'])
 * show - в зависимост от стойността:
 * 	при 0 - показва линка на всички - регистрирани(логнати) и нерегистрирани(нелогнати) потребители
 *  при 1 - показва линка само на НЕРЕГИСТРИРАНИ (т.е. не логнати) потребители
 *  при 2 - показва линка само на РЕГИСТРИРАНИ (т.е. логнати) потребители
 */
$menu = array(
	array(
		'title' => 'Начало',
		'page' => '', /*
		 * не попълваме стойност, защото в логиката в index.php сме
		 * направили switch при default винаги да показва началната страница
		 */
		'show' => 0
	),
	array(
		'title' => 'Регистрация',
		'page' => 'register',
		'show' => 1
	),
	array(
		'title' => 'Логин',
		'page' => 'login',
		'show' => 1
	),
	array(
		'title' => 'Добави новина',
		'page' => 'add_news',
		'show' => 2
	),
	array(
		'title' => 'Изход',
		'page' => 'logout',
		'show' => 2
	)
);

$template_name = 'base_template'; //Койт темплейт ще използваме

$categories = array(
	0 => 'Всякакви',
	1 => 'Политически',
	2 => 'Sports',
	3 => 'Клюки'
);
