<div id="menu">
	<h1 class="center-text">Меню:</h1>
	<hr>
	<ul>
		<?php
		/*
		 * Обхождаме целия масив с линковете в менюто, който създадохме в
		 * config.php и присвоихме към ключа menu_items на $data.
		 */
		foreach($data['menu_items'] as $item) {
			/* Създаваме си 1 променлива, която ще отговаря дали да се показва
			 * линка. По подразбиране не се показва. След това в зависимост от
			 * стойността на ключа show в масива с линковете реализираме логика.
			 */
			$show = FALSE;
			switch($item['show']) {
				case 1: //В този случай искаме да покажем линка само ако потребителя НЕ Е логнат
					if(!isUserLogged()) { //Извикваме функцията, която създадохме в functions.php файла
						$show = TRUE; //И ако НЕ Е логнат променяме променливата на TRUE, за да покажем линка
					}
				break;
			
				case 2: //В този случай искаме да покажем линка само ако потребителя Е логнат
					if(isUserLogged()) { //Извикваме функцията, която създадохме в functions.php файла
						$show = TRUE; //И ако Е логнат променяме променливата на TRUE, за да покажем линка
					}
				break;
			
				default: //Във всички останали случаи
					$show = TRUE; //Слагаме променливата на TRUE за да покажем линка
				break;
			}
			
			//В крайна сметка проверяваме дали променливата $show е TRUE и ако е показваме линка
			if($show) {
				echo '<li><a href="./index.php?page='.$item['page'].'">'.$item['title'].'</a></li>';
			}
		}
		?>
	</ul>
</div>