<meta charset="utf-8">
<?php
/*
 * Задача #4
 * Направете масив с числата от 1 до 300 и взимайки стойностите от него направете нов масив със същите числа, но на втора степен.
 * Накрая съберете всички числа от втория масив и изкарайте резултата на екрана.
 */

//Създаваме масив и го попълваме с числата от 1 до 300
$numbers = array();
for($i=1;$i<=300;$i++) {
	$numbers[] = $i; //Когато не посочите ключ между скобите, той се попълва автоматично, започвайки от 0
}

//Създаваме втори масив и го попълваме с числата от първия масив, но на втора степен
$powered_numbers = array();
foreach($numbers as $number) {
	$powered_numbers[] = pow($number, 2);
}

//Събираме всички числа от втория масив
$sum = 0;
foreach($powered_numbers as $powered_number) {
	$sum += $powered_number;
}

echo 'Резултатът е: '.$sum;
?>